; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	image0 - mode
	thermograph3 - mode
	infrared1 - mode
	image2 - mode
	infrared4 - mode
	star3 - direction
	star4 - direction
	groundstation2 - direction
	star1 - direction
	star0 - direction
	star5 - direction
	planet6 - direction
	star7 - direction
	planet8 - direction
	phenomenon9 - direction
	planet10 - direction
	star11 - direction
	phenomenon12 - direction
	planet13 - direction
	planet14 - direction
	planet15 - direction
	star16 - direction
	phenomenon17 - direction
	phenomenon18 - direction
	phenomenon19 - direction
	planet20 - direction
	phenomenon21 - direction
	planet22 - direction
	planet23 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image2)
	(calibration_target instrument0 star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 star16)
	(supports instrument1 image0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet13)
	(supports instrument2 thermograph3)
	(supports instrument2 image0)
	(supports instrument2 infrared4)
	(calibration_target instrument2 star4)
	(supports instrument3 thermograph3)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 groundstation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 star7)
	(supports instrument4 infrared4)
	(calibration_target instrument4 star1)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star1)
	(supports instrument5 infrared4)
	(supports instrument5 image2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 star0)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star3)
)
(:goal (and
	(pointing satellite1 star11)
	(pointing satellite2 planet20)
	(pointing satellite3 planet8)
	(have_image star5 image2)
	(have_image planet6 image0)
	(have_image star7 thermograph3)
	(have_image planet8 infrared4)
	(have_image phenomenon9 thermograph3)
	(have_image star11 thermograph3)
	(have_image phenomenon12 image2)
	(have_image planet13 infrared1)
	(have_image planet14 image2)
	(have_image planet15 thermograph3)
	(have_image star16 infrared4)
	(have_image phenomenon17 image2)
	(have_image phenomenon18 image0)
	(have_image phenomenon19 thermograph3)
	(have_image planet20 infrared4)
	(have_image phenomenon21 image0)
	(have_image planet22 infrared4)
	(have_image planet23 image2)
))

)

; plan
1. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 0 of 21
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 21
3. (turn_to satellite4 phenomenon12 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 21
4. (turn_to satellite3 planet8 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet8)
   goals met: 1 of 21
5. (turn_to satellite2 groundstation2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 21
6. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 1 of 21
7. (turn_to satellite2 phenomenon18 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon18)
   goals met: 1 of 21
8. (take_image satellite2 phenomenon18 instrument3 image0)
   added: (have_image phenomenon18 image0)
   goals met: 2 of 21
9. (turn_to satellite2 phenomenon19 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon19)
   goals met: 2 of 21
10. (take_image satellite2 phenomenon19 instrument3 thermograph3)
   added: (have_image phenomenon19 thermograph3)
   goals met: 3 of 21
11. (turn_to satellite2 phenomenon21 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 phenomenon21)
   goals met: 3 of 21
12. (take_image satellite2 phenomenon21 instrument3 image0)
   added: (have_image phenomenon21 image0)
   goals met: 4 of 21
13. (turn_to satellite2 phenomenon9 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 phenomenon9)
   goals met: 4 of 21
14. (take_image satellite2 phenomenon9 instrument3 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 5 of 21
15. (turn_to satellite2 planet13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet13)
   goals met: 5 of 21
16. (take_image satellite2 planet13 instrument3 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 6 of 21
17. (turn_to satellite2 planet15 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet15)
   goals met: 6 of 21
18. (take_image satellite2 planet15 instrument3 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 7 of 21
19. (turn_to satellite2 planet20 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet20)
   goals met: 8 of 21
20. (turn_to satellite1 star11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star11)
   goals met: 9 of 21
21. (turn_to satellite4 star0 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star0)
   goals met: 9 of 21
22. (calibrate satellite4 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 9 of 21
23. (turn_to satellite4 phenomenon12 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon12)
   goals met: 9 of 21
24. (take_image satellite4 phenomenon12 instrument5 image2)
   added: (have_image phenomenon12 image2)
   goals met: 10 of 21
25. (turn_to satellite4 phenomenon17 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon17)
   goals met: 10 of 21
26. (take_image satellite4 phenomenon17 instrument5 image2)
   added: (have_image phenomenon17 image2)
   goals met: 11 of 21
27. (turn_to satellite4 planet14 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 planet14)
   goals met: 11 of 21
28. (take_image satellite4 planet14 instrument5 image2)
   added: (have_image planet14 image2)
   goals met: 12 of 21
29. (turn_to satellite4 planet20 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet20)
   goals met: 12 of 21
30. (take_image satellite4 planet20 instrument5 infrared4)
   added: (have_image planet20 infrared4)
   goals met: 13 of 21
31. (turn_to satellite4 planet22 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet22)
   goals met: 13 of 21
32. (take_image satellite4 planet22 instrument5 infrared4)
   added: (have_image planet22 infrared4)
   goals met: 14 of 21
33. (turn_to satellite4 planet23 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet23)
   goals met: 14 of 21
34. (take_image satellite4 planet23 instrument5 image2)
   added: (have_image planet23 image2)
   goals met: 15 of 21
35. (turn_to satellite4 planet8 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 planet8)
   goals met: 15 of 21
36. (take_image satellite4 planet8 instrument5 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 16 of 21
37. (turn_to satellite4 star16 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star16)
   goals met: 16 of 21
38. (take_image satellite4 star16 instrument5 infrared4)
   added: (have_image star16 infrared4)
   goals met: 17 of 21
39. (turn_to satellite4 star5 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star5)
   goals met: 17 of 21
40. (take_image satellite4 star5 instrument5 image2)
   added: (have_image star5 image2)
   goals met: 18 of 21
41. (turn_to satellite2 planet6 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet6)
   goals met: 17 of 21
42. (take_image satellite2 planet6 instrument3 image0)
   added: (have_image planet6 image0)
   goals met: 18 of 21
43. (turn_to satellite2 planet20 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet20)
   goals met: 19 of 21
44. (turn_to satellite2 star11 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 star11)
   goals met: 18 of 21
45. (take_image satellite2 star11 instrument3 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 19 of 21
46. (turn_to satellite2 planet20 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet20)
   goals met: 20 of 21
47. (turn_to satellite2 star7 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 star7)
   goals met: 19 of 21
48. (take_image satellite2 star7 instrument3 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 20 of 21
49. (turn_to satellite2 planet20 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet20)
   goals met: 21 of 21
